Revit 2024 API
ViewSchedule.GetTableData Method
 Gets the writable table data object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public TableData GetTableData()
Visual Basic
Public Function GetTableData As TableData
Visual C++
public:
TableData^ GetTableData()
Return Value
 The schedule data object.
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace